[
  {
    "id": 1,
    "slug": "legal-online-system",
    "title": "Legal Online System",
    "description": "Internal legal management system of PT Elnusa Tbk for managing contracts, legal cases, and corporate documents, fully integrated with SAP and Supply Chain Management (SCM). This system was fully migrated from a legacy PHP application to a new microservices-based architecture, rebuilt from scratch end-to-end by the developer.",
    "fullDescription": "Legal Online is a comprehensive internal web-based system developed for PT Elnusa Tbk to centralize and manage all legal-related documents and processes, including contracts, litigation cases, legal certificates, corporate documents, property files, swakelola agreements, partnerships, Memorandum of Understanding (MoU), and procurement contracts. The system is tightly integrated with SAP and the Supply Chain Management (SCM) platform to ensure data consistency and traceability across business and legal operations.\n\nThis project involved a full migration from a legacy PHP-based application to a modern microservices architecture using Vue, Express, TypeScript, and Moleculer. The system was rebuilt from scratch, starting from requirement analysis, system design, development, until production rollout, handled end-to-end by a single developer.\n\nKey features include contract lifecycle management with status tracking, detailed history of contract updates, role-based access control for Admin, Manager, and Officer, automated email notifications for contract expiration reminders, and real-time synchronization with enterprise systems. This platform significantly improves document control, compliance monitoring, and operational efficiency by reducing manual processes and ensuring that all legal activities are auditable and transparent.",
    "image": "/project/legal/1.png",
    "images": ["/project/legal/1.png"],
    "techStack": [
      "Vue",
      "Express",
      "TypeScript",
      "Moleculer",
      "Microservices",
      "SAP Integration"
    ],
    "category": "Web Dev",
    "featured": true,
    "liveUrl": "https://equanta.elnusa.co.id/legal",
    "githubUrl": ""
  },
  {
    "id": 2,
    "slug": "overtime-online-system",
    "title": "Overtime Online System",
    "description": "Internal overtime management system of PT Elnusa Tbk with bug fixing, attendance synchronization, and payroll integration with SAP.",
    "fullDescription": "Overtime Online is an internal system of PT Elnusa Tbk designed to manage the complete overtime workflow, starting from employee overtime requests, validation with the Attendance Online System, multi-level approvals by Manager, Senior Manager (SM), HCBP, and Payroll, up to final payment processing through SAP.\n\nThe main contributions in this project include fixing critical bugs, improving system stability, and implementing real-time synchronization with the Attendance Online application to ensure accurate working hour calculation.\n\nThe system provides real-time status tracking, structured approval flows, and role-based access for Employee, Manager, SM, HCBP, and Payroll. By integrating attendance data and SAP payroll, the platform ensures compliance with company policies, transparent audit trails, and significantly reduces administrative overhead and payroll discrepancies.",
    "image": "/project/overtime/1.png",
    "images": ["/project/overtime/1.png"],
    "techStack": [
      "Vue",
      "Express",
      "Node.js",
      "Moleculer",
      "Microservices",
      "SAP Integration"
    ],
    "category": "Web Dev",
    "featured": true,
    "liveUrl": "https://equanta.elnusa.co.id",
    "githubUrl": ""
  },
  {
    "id": 3,
    "slug": "advance-payment-system",
    "title": "Advance Payment System",
    "description": "Internal financial system of PT Elnusa Tbk for managing advance payments and corporate card transactions, fully migrated from a legacy PHP application and rebuilt from scratch using modern microservices architecture.",
    "fullDescription": "The Advance Payment & Corporate Card System is a mission-critical internal financial platform at PT Elnusa Tbk that manages the end-to-end process of advance payments (panjar kerja) and corporate card usage, from initial submission and approval, fund disbursement, expense reporting, to final accountability and reconciliation.\n\nThis system was fully migrated from an older PHP-based application to a new technology stack using Vue, Express, Node.js, and Moleculer. The migration and redevelopment were carried out end-to-end, starting from system redesign, database restructuring, service development, integration with SAP, until production deployment, handled independently by a single developer.\n\nThe system supports multiple roles such as Admin, Finance Controller, Treasury, and APM, enforces financial controls, provides complete audit trails, and integrates directly with SAP for accounting and reporting. Handling monthly transactions reaching tens of billions of rupiah, the platform ensures transparency, regulatory compliance, and efficient cash flow management across the organization.",
    "image": "/project/advance-payment/1.png",
    "images": ["/project/advance-payment/1.png"],
    "techStack": [
      "Vue",
      "Express",
      "Node.js",
      "Moleculer",
      "Microservices",
      "SAP Integration"
    ],
    "category": "Web Dev",
    "featured": true,
    "liveUrl": "https://equanta.elnusa.co.id/advysis",
    "githubUrl": ""
  },
  {
    "id": 4,
    "slug": "supply-chain-management",
    "title": "Supply Chain Management System",
    "description": "Internal Supply Chain Management system of PT Elnusa Tbk with implementation of new features and security enhancements including RBAC, authorization checks, and multitenant architecture.",
    "fullDescription": "This project focuses on enhancing the internal Supply Chain Management (SCM) system of PT Elnusa Tbk by implementing new functional modules such as BAST (Berita Acara Serah Terima) and online negotiation, along with comprehensive security enhancements.\n\nKey contributions include implementation of role-based access control (RBAC), fine-grained authorization checks, multitenant architecture, and overall system hardening to ensure secure and scalable operations across multiple business units. These improvements strengthen governance, data security, and operational efficiency in procurement and supply chain processes.",
    "image": "/project/scm/1.png",
    "images": ["/project/scm/1.png"],
    "techStack": ["Vue", "Express", "Node.js", "Moleculer", "Microservices"],
    "category": "Web Dev",
    "featured": false,
    "liveUrl": "https://equanta.elnusa.co.id/elsascm",
    "githubUrl": ""
  },
  {
    "id": 5,
    "slug": "vendor-management-system",
    "title": "Vendor Management System",
    "description": "Internal vendor lifecycle management system of PT Elnusa Tbk with feature implementation and security enhancements including RBAC, authorization, and multitenancy.",
    "fullDescription": "The Vendor Management System (VMS) is an internal enterprise platform at PT Elnusa Tbk that manages the complete vendor lifecycle, including registration, qualification, negotiation, transaction processing, and performance monitoring.\n\nKey responsibilities in this project include implementation of new functional features such as BAST and online negotiation, as well as security enhancements covering role-based access control (RBAC), authorization validation, multitenant support, and overall system hardening. These improvements ensure secure access, data isolation between business units, and scalable vendor operations, enabling more transparent and efficient procurement and vendor relationship management.",
    "image": "/project/vms/1.png",
    "images": ["/project/vms/1.png"],
    "techStack": ["Vue", "Express", "Node.js", "Moleculer", "Microservices"],
    "category": "Web Dev",
    "featured": false,
    "liveUrl": "https://equanta.elnusa.co.id/elsascm-vendor",
    "githubUrl": ""
  },
  {
    "id": 6,
    "slug": "eazytask-scheduler",
    "title": "Eazytask - Online Scheduler",
    "description": "Web-based employee scheduling and payroll management system for a security company in Australia, including system migration and mobile API development.",
    "fullDescription": "Eazytask is an online scheduler and management system used by a security services company based in Australia to manage employee shift scheduling, attendance, and payroll data.\n\nResponsibilities in this project included migrating the existing application from Laravel-based frontend to a modern Vue.js interface and developing RESTful APIs to support a mobile application. The migration improved performance, user experience, and maintainability while enabling seamless integration between web and mobile platforms.",
    "image": "/project/eazytask/1.png",
    "images": ["/project/eazytask/1.png", "/project/eazytask/2.png", "/project/eazytask/3.png"],
    "techStack": ["Vue.js", "Laravel"],
    "category": "Web Dev",
    "featured": false,
    "liveUrl": "https://eazytask.au",
    "githubUrl": ""
  },
  {
    "id": 7,
    "slug": "estimator-id",
    "title": "Estimator.id",
    "description": "Web-based application for designing cost estimation (RAB) with real-time collaboration using spreadsheet integration and project management modules.",
    "fullDescription": "Estimator.id is a web application used to design and manage Rencana Anggaran Biaya (RAB). The system features a spreadsheet-like module with real-time collaboration by integrating Google Spreadsheet, allowing multiple users to work simultaneously.\n\nAdditional modules include Gantt Chart for project scheduling, career and affiliation pages, promotion management, demo request handling, and article publishing. The project involved developing the spreadsheet engine, Google Spreadsheet integration, and multiple business modules to support collaboration and project planning workflows.",
    "image": "/project/estimator/1.png",
    "images": ["/project/estimator/1.png"],
    "techStack": ["PHP", "Node.js", "CodeIgniter", "Express.js"],
    "category": "Web Dev",
    "featured": false,
    "liveUrl": "https://estimator.id",
    "githubUrl": ""
  },
  {
    "id": 8,
    "slug": "go-toko-pos",
    "title": "Go-Toko POS (Mobile & Web)",
    "description": "Point of Sales (POS) application for managing store operations including inventory, restock, cashier, payments, and reporting, developed for small to medium businesses with Owner and Cashier roles.",
    "fullDescription": "Go-Toko is a mobile and web-based Point of Sales (POS) system designed to help store owners manage daily operations such as inventory tracking, stock restocking, cashier transactions, payment processing, and sales reporting. The system supports role-based access for Owner and Cashier, enabling real-time monitoring of sales performance and stock levels.\n\nThe project involved end-to-end development of both mobile and backend services, ensuring seamless synchronization between transaction data, inventory, and reports. The application is published on Google Play Store and built with modern mobile and backend technologies to ensure scalability and reliability for retail businesses.",
    "image": "/project/go-toko/1.png",
    "images": ["/project/go-toko/1.png", "/project/go-toko/2.png", "/project/go-toko/3.png", "/project/go-toko/4.png"],
    "techStack": ["Kotlin", "Jetpack Compose", "Golang", "Laravel"],
    "category": "Android Dev",
    "featured": false,
    "liveUrl": "https://play.google.com/store/apps/details?id=com.d3ti.go.toko&hl=mk",
    "githubUrl": ""
  },
  {
      "id": 9,
    "slug": "sentiment-pemilu",
    "title": "Sentiment Analysis Pemilu",
    "description": "Web application for analyzing public sentiment on the Indonesian election using Instagram comment scraping and machine learning classification.",
    "fullDescription": "This application was developed to analyze public sentiment related to the Indonesian Presidential Election by scraping more than 50,000 Instagram comments. The system processes raw social media data and applies a Naive Bayes classification model with Chi-Square feature selection to categorize sentiments into positive, negative, and neutral.\n\nThe platform provides dashboards for users and administrators to monitor sentiment trends, dataset statistics, and model performance. It combines web technologies with data science pipelines, integrating PHP and Laravel for the application layer, Python for data processing and machine learning, and Flask for serving the ML model.",
    "image": "/project/pemilu/1.png",
    "images": ["/project/pemilu/1.png", "/project/pemilu/2.png", "/project/pemilu/3.png"],
    "techStack": ["PHP", "Python", "Laravel", "Flask"],
    "category": "Web Dev",
    "featured": false,
    "liveUrl": "",
    "githubUrl": ""
  },

  {
    "id": 10,
    "slug": "perkasa-attendance",
    "title": "PERKASA - Smart Attendance",
    "description": "Smart attendance, leave request, and payroll system for employee management.",
    "fullDescription": "PERKASA (PERangkat Kepegawaian Aktualisasi Sumberdaya Anda) is a smart attendance system designed to manage employee check-in/check-out, leave requests, and payroll processing.\n\nThe system consists of a mobile application for employees and a backend service to manage attendance records, approval workflows, and payroll calculation. It was developed using modern Android technologies and a scalable backend to ensure reliability and performance for enterprise usage.",
    "image": "/project/perkasa/1.png",
    "images": ["/project/perkasa/1.png", "/project/perkasa/2.png", "/project/perkasa/3.png"],
    "techStack": ["Kotlin", "Jetpack Compose", "Express"],
    "category": "Android Dev",
    "featured": false,
    "liveUrl": "",
    "githubUrl": ""
  },

  {
    "id": 11,
    "slug": "ruang-cerita",
    "title": "Ruang Cerita - Online Consultation",
    "description": "Mobile consultation application with booking, chat, and video call features for online counseling services.",
    "fullDescription": "Ruang Cerita is a mobile-based consultation platform that allows users to book consultation sessions, communicate with consultants via chat, and conduct video calls.\n\nThe application was built using modern Android UI with Jetpack Compose and supported by an Express.js backend to handle authentication, scheduling, real-time messaging, and video call session management. The system is designed to provide a secure and user-friendly experience for online mental health and professional consultations.",
    "image": "/project/ruang-cerita/1.png",
    "images": ["/project/ruang-cerita/1.png", "/project/ruang-cerita/2.png", "/project/ruang-cerita/3.png"],
    "techStack": ["Kotlin", "Jetpack Compose", "Express.js"],
    "category": "Android Dev",
    "featured": false,
    "liveUrl": "",
    "githubUrl": ""
  }
]
