[
  {
    "id": 1,
    "slug": "legal-online-system",
    "title": "Legal Online System",
    "description": "Internal legal management system of PT Elnusa Tbk for managing contracts, legal cases, and corporate documents, fully integrated with SAP and Supply Chain Management (SCM) to support end-to-end legal governance and compliance.",
    "fullDescription": "Legal Online is a comprehensive internal web-based system developed for PT Elnusa Tbk to centralize and manage all legal-related documents and processes, including contracts, litigation cases, legal certificates, corporate documents, property files, swakelola agreements, partnerships, Memorandum of Understanding (MoU), and procurement contracts. The system is tightly integrated with SAP and the Supply Chain Management (SCM) platform to ensure data consistency and traceability across business and legal operations.\n\nKey features include contract lifecycle management with status tracking, detailed history of contract updates, role-based access control for Admin, Manager, and Officer, automated email notifications for contract expiration reminders, and real-time synchronization with enterprise systems. This platform significantly improves document control, compliance monitoring, and operational efficiency by reducing manual processes and ensuring that all legal activities are auditable and transparent.",
    "image": "/project/legal/1.png",
    "images": ["/project/legal/1.png", "/project/legal/2.png", "/project/legal/3.png"],
    "techStack": ["Vue", "Express", "TypeScript", "Moleculer", "Microservices", "SAP Integration"],
    "category": "Web Dev",
    "featured": true,
    "liveUrl": "",
    "githubUrl": ""
  },
  {
    "id": 2,
    "slug": "overtime-online-system",
    "title": "Overtime Online System",
    "description": "Internal overtime management system of PT Elnusa Tbk that handles submission, multi-level approval, and payroll integration with attendance and SAP systems.",
    "fullDescription": "Overtime Online is an internal system of PT Elnusa Tbk designed to manage the complete overtime workflow, starting from employee overtime requests, validation with the Attendance Online System, multi-level approvals by Manager, Senior Manager (SM), HCBP, and Payroll, up to final payment processing through SAP.\n\nThe system provides real-time status tracking, structured approval flows, and role-based access for Employee, Manager, SM, HCBP, and Payroll. By integrating attendance data and SAP payroll, the platform ensures accurate calculation of working hours, compliance with company policies, and transparent, auditable overtime payments, significantly reducing administrative overhead and processing errors.",
    "image": "/project/overtime/1.png",
    "images": ["/project/overtime/1.png", "/project/overtime/2.png", "/project/overtime/3.png"],
    "techStack": ["Vue", "Express", "Node.js", "Moleculer", "Microservices", "SAP Integration"],
    "category": "Web Dev",
    "featured": true,
    "liveUrl": "",
    "githubUrl": ""
  },
  {
    "id": 3,
    "slug": "advance-payment-system",
    "title": "Advance Payment System",
    "description": "Internal financial system of PT Elnusa Tbk for managing advance payments and corporate card transactions with full accountability and SAP integration.",
    "fullDescription": "The Advance Payment & Corporate Card System is a mission-critical internal financial platform at PT Elnusa Tbk that manages the end-to-end process of advance payments (panjar kerja) and corporate card usage, from initial submission and approval, fund disbursement, expense reporting, to final accountability and reconciliation.\n\nThe system supports multiple roles such as Admin, Finance Controller, Treasury, and APM, enforces financial controls, provides complete audit trails, and integrates directly with SAP for accounting and reporting. Handling monthly transactions reaching tens of billions of rupiah, the platform ensures transparency, compliance with financial regulations, and efficient cash flow management across the organization.",
    "image": "/project/advance-payment/1.png",
    "images": ["/project/advance-payment/1.png", "/project/advance-payment/2.png", "/project/advance-payment/3.png"],
    "techStack": ["Vue", "Express", "Node.js", "Moleculer", "Microservices", "SAP Integration"],
    "category": "Web Dev",
    "featured": true,
    "liveUrl": "",
    "githubUrl": ""
  },
  {
    "id": 4,
    "slug": "supply-chain-management",
    "title": "Supply Chain Management System",
    "description": "Internal Supply Chain Management system of PT Elnusa Tbk enhanced with BAST, online negotiation, RBAC, authorization checks, and multitenant architecture.",
    "fullDescription": "This project focuses on enhancing the internal Supply Chain Management (SCM) system of PT Elnusa Tbk by implementing key enterprise features such as BAST (Berita Acara Serah Terima), online negotiation modules, advanced security mechanisms, role-based access control (RBAC), strict authorization checks, and multitenancy support.\n\nThese improvements strengthen data security, ensure proper segregation of duties, and enable the platform to serve multiple business units within a single scalable architecture, ultimately improving procurement governance, transparency, and operational efficiency.",
    "image": "/project/scm/1.png",
    "images": ["/project/scm/1.png", "/project/scm/2.png", "/project/scm/3.png"],
    "techStack": ["Vue", "Express", "Node.js", "Moleculer", "Microservices"],
    "category": "Web Dev",
    "featured": false,
    "liveUrl": "",
    "githubUrl": ""
  },
  {
    "id": 5,
    "slug": "vendor-management-system",
    "title": "Vendor Management System",
    "description": "Internal vendor lifecycle management system of PT Elnusa Tbk with online negotiation, RBAC, enhanced security, and multitenancy.",
    "fullDescription": "The Vendor Management System (VMS) is an internal enterprise platform at PT Elnusa Tbk that manages the complete vendor lifecycle, including registration, qualification, negotiation, transaction processing, and performance monitoring.\n\nKey implementations include BAST, online negotiation features, security hardening, role-based access control (RBAC), authorization validation, and multitenant architecture. The system improves vendor data integrity, ensures secure access, and supports scalable operations across multiple business units, enabling more transparent and efficient procurement and vendor relationship management.",
    "image": "/project/vms/1.png",
    "images": ["/project/vms/1.png", "/project/vms/2.png", "/project/vms/3.png"],
    "techStack": ["Vue", "Express", "Node.js", "Moleculer", "Microservices"],
    "category": "Web Dev",
    "featured": false,
    "liveUrl": "",
    "githubUrl": ""
  }
]
